<unk>
the
to
and
a
of
is
in
you
it
that
abuse
harm
dangerous
risk
violence
exploitation
child
safety
protect
inappropriate
adult
content
illegal
threat
suspect
warning
danger
alert
malicious
predator
grooming
harassment
bullying
cyberbullying
assault
rape
murder
killing
torture
suffering
pain
injury
threat
weapon
gun
knife
bomb
poison
drug
alcohol
addict
addiction
addiction
abuse
neglect
abandonment
trauma
sexual
intercourse
intercourse
nude
naked
exposure
pornography
pornographic
graphic
explicit
ich
vulgar
profanity
curse
insult
derogatory
racist
racist
racist
sexist
homophobic
transphobic
xenophobic
antisemitic
religious
discrimination
bigotry
hate
hateful
intolerant
prejudice
bias
stereotyping
mockery
ridicule
shame
embarrassment
humiliation
degradation
debasement
defamation
slander
libel
false
accusation
accuse
accusing
blame
blaming
fault
guilty
innocent
conviction
sentence
prison
jail
arrest
charges
charge
charging
criminal
crime
crimes
felony
misdemeanor
violation
violation
violation
infraction
infraction
infraction
infraction
violation
violation
violation
violation
breach
breach
breach
breach
transgression
transgression
transgression
transgression
wrongdoing
wrongdoing
wrongdoing
wrongdoing
misconduct
misconduct
misconduct
misconduct
impropriety
impropriety
impropriety
impropriety
indecency
indecency
indecency
indecency
obscenity
obscenity
obscenity
obscenity
lewdness
lewdness
lewdness
lewdness
lechery
lechery
lechery
lechery
lust
lust
lust
lust
desire
desire
desire
desire
craving
craving
craving
craving
yearning
yearning
yearning
yearning
longing
longing
longing
longing
hunger
hunger
hunger
hunger
thirst
thirst
thirst
thirst
appetite
appetite
appetite
appetite
greed
greed
greed
greed
avarice
avarice
avarice
avarice
covetousness
covetousness
covetousness
covetousness
jealousy
jealousy
jealousy
jealousy
envy
envy
envy
envy
resentment
resentment
resentment
resentment
anger
anger
anger
anger
rage
rage
rage
rage
wrath
wrath
wrath
wrath
fury
fury
fury
fury
indignation
indignation
indignation
indignation
ire
ire
ire
ire
bile
bile
bile
bile
gall
gall
gall
gall
rancor
rancor
rancor
rancor
malice
malice
malice
malice
spite
spite
spite
spite
venom
venom
venom
venom
poison
poison
poison
poison
toxin
toxin
toxin
toxin
